# SetServiceGroupExclusions Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
FabricationService..::..SetServiceGroupExclusions Method
FabricationService Class See Also
---
This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `SetServicePaletteExclusions` method instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
[ObsoleteAttribute]
public bool SetServiceGroupExclusions(
	IList<int> excludedGroups
)
```

Visual Basic
---
```text
<ObsoleteAttribute> _
Public Function SetServiceGroupExclusions ( _
	excludedGroups As IList(Of Integer) _
) As Boolean
```

Visual C++
---
```text
[ObsoleteAttribute]
public:
bool SetServiceGroupExclusions(
	IList<int>^ excludedGroups
)
```

# ### Parameters
excludedGroups
    Type: System.Collections.Generic..::..IList<(Of <(<'Int32>)>)> A list of service group indexes to be excluded.
# ### Return Value
Returns true if succeeded to set the exclusions to the specified group(s).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | paletteIndices contains an index that is not larger or equal to 0 and less than PaletteCount |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace